uhnp/src/Documents/ОтветНаЗапросНалоговогоМониторинга/ОтветНаЗапросНалоговогоМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтветНаЗапросНалоговогоМониторинга</name>
  <basedOn>Document.ЗапросДанныхНалоговогоМониторинга</basedOn>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗапросДанныхНалоговогоМониторинга</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросОтклонен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьДокументов</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>CatalogRef.ВидыЗапрашиваемойОтчетностиНалоговогоМониторинга</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скан</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяБезРасширения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаОбъектСистемы</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/ОтветНаЗапросНалоговогоМониторинга/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Осуществляет заполнение текущего документа по данным документа Запрос данных
// налогового мониторинга ЗапросДанныхВход.
Процедура ЗаполнитьПоЗапросуДанныхНалоговогоМониторинга(ЗапросДанныхВход)
	Основание = ЗапросДанныхВход;
	ПереченьДокументов.Очистить();
	Для Каждого ТекСтрокаПереченьДокументов Из ЗапросДанныхВход.ПереченьДокументов Цикл
		НоваяСтрока = ПереченьДокументов.Добавить();
		НоваяСтрока.Документ = ТекСтрокаПереченьДокументов.Документ;
	КонецЦикла;
КонецПроцедуры		// ЗаполнитьПоЗапросуДанныхНалоговогоМониторинга()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗапросДанныхНалоговогоМониторинга") Тогда
		// Заполнение по документу Запрос данных налогового мониторинга.
		Основание = ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда	
		// Заполнение по произвольной структуре.
		ДокументОснование = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Основание", Неопределено);
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗапросДанныхНалоговогоМониторинга") Тогда
			Основание = ДокументОснование;
		Иначе
			// Неизвестный вариант. Пропускаем заполнение.
		КонецЕсли;
	КонецЕсли;
	// Заполнение по основанию.
	Если ЗначениеЗаполнено(Основание) Тогда
		ЗаполнитьПоЗапросуДанныхНалоговогоМониторинга(Основание);
	Иначе
		// Основание не задано. Пропускаем.  
	КонецЕсли;
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

#КонецЕсли
